Revit 2027 API
FailuresProcessingEventArgs.GetProcessingResult Method
 Retrieves current status of the failures processing result.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureProcessingResult GetProcessingResult()
Public Function GetProcessingResult As FailureProcessingResult
public:
FailureProcessingResult GetProcessingResult()
member GetProcessingResult : unit -> FailureProcessingResult
Return Value
FailureProcessingResult
 The current failures processing result.
See Also
Reference
FailuresProcessingEventArgs Class
Autodesk.Revit.DB.Events Namespace